hatena/progress.org
[[https://masayuki054.hatenablog.com/entry/2021/03/11/103431][top]] / [[https://masayuki054.hatenablog.com/entry/2021/10/06/101325?_ga=2.170599136.1369059129.1633482592-251679600.1592307203][R ]]/ [[https://masayuki054.hatenablog.com/entry/2021/10/06/103338?_ga=2.200886382.1369059129.1633482592-251679600.1592307203][進行]]
* 4th 11/07

  先週は休講にしてすみませんでした。
  
** RStudio を使いましょう

   - 生物統計用のプロジェクトを作ろう
   - 毎回のRのプログラムを，R-スクリプトとして残そう 
     
** [[https://oku.edu.mie-u.ac.jp/~okumura/stat/first.html][Rの初歩]]
   - RStudioの概要
   - プロジェクトの作成

** R 入門
   - [[http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf][初心者用 - R_Stats2.pdf]]，
   - 先生の演習ノート [[https://github.com/masayuki054/bio_stat/blob/main/org/R-intro-2.org][bio_stat/R-intro-2.org at main · masayuki054/bio_stat]] 
     - 簡単な行列の作成と演算
     - 簡単なリストの作成
     - 簡単なデータフレームの作成
     
** Rによる統計入門
   - スライドまたは PDF を手元に準備
   - http://wiki.cis.iwate-u.ac.jp/~suzuki/bio_stat/org     
     
*** 入門統計学の1章
   - スライドまたは PDF を手元に準備

**** Rの演習
     - [[http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/distribution.html][生物統計学１]]
       - 2. データの図示と基本統計量の計算 をやってみましょう

     今日の演習内容をファイルに保存しましょう。
     - 自分のRの演習フォルダに
     - 日付と項目がわかるように。

*** 入門統計学の2章

**** Rの演習
     - http://wiki.cis.iwate-u.ac.jp/~suzuki/biostat/R-text-02.html
       - 2. データの図示と基本統計量の計算 をやってみましょう


* 3rd 10/28

  先週は休講にしてすみませんでした。
  
** RStudio を使いましょう
   - 生物統計用のプロジェクトを作ろう
   - 毎回のRのプログラムを，R-スクリプトとして残そう 
     
** [[https://oku.edu.mie-u.ac.jp/~okumura/stat/first.html][Rの初歩]]
   - RStudioの概要
   - プロジェクトの作成

** R 入門
   - [[http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf][初心者用 - R_Stats2.pdf]]，
   - 先生の演習ノート [[https://github.com/masayuki054/bio_stat/blob/main/org/R-intro-2.org][bio_stat/R-intro-2.org at main · masayuki054/bio_stat]] 
     - 簡単な行列の作成と演算
     - 簡単なリストの作成
     - 簡単なデータフレームの作成
     
** Rによる統計入門
   - スライドまたは PDF を手元に準備
   - http://wiki.cis.iwate-u.ac.jp/~suzuki/bio_stat/org     
     
*** 入門統計学の1章
   - スライドまたは PDF を手元に準備

**** Rの演習
     - [[http://lbm.ab.a.u-tokyo.ac.jp/~omori/noko/distribution.html][生物統計学１]]
       - 2. データの図示と基本統計量の計算 をやってみましょう

     今日の演習内容をファイルに保存しましょう。
     - 自分のRの演習フォルダに
     - 日付と項目がわかるように。

*** 入門統計学の2章

**** Rの演習
     - http://wiki.cis.iwate-u.ac.jp/~suzuki/biostat/R-text-02.html
       - 2. データの図示と基本統計量の計算 をやってみましょう

* 2nd 10/14
  
** 講義について

   - お昼休みサッカー (再度)
     - 12:30 ~ グラウンド， 2~10名でのミニゲーム，素人多数，先生，職
       員，学生

** Done スライドとデータの準備

   - 確認 全員 office 有り
   - ファイル，フォルダ操作の慣れ

     : c:/Users/名前/Onedrive/Documents/R (/は円記号かもしれない)
 
** Done R のインストール
   CLOSED: [2021-10-13 水 21:09]
   
** Rcmdr か RStudio を使いましょう
   - Rcmdr の起動       
     : library(Rcmdr)

   - Rcmdr を自動的に起動する方法
     - [[http://plaza.umin.ac.jp/~takeshou/R/Rcmdrfirst.html][Rコマンダーの簡単な使い方]]
     
** [[https://oku.edu.mie-u.ac.jp/~okumura/stat/first.html][Rの初歩]]
   - RStudioの概要
   - help
   - 終了
   - ワーキング・ディレクトリ(フォルダ)， .Rhistory, .RData, ~/.Rprofile
      
** R 入門

   - [[http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf][初心者用 - R_Stats2.pdf]]

     これを何回かかけてやりましょう
     - 起動と終了
     - 変数への代入
     - 簡単な演算
     - 簡単なベクトル演算
     - 簡単な行列の作成と演算
     - 簡単なリストの作成

** Rによる統計入門
   
*** 入門統計学の1章
   - Excel -> R で書き直し
   - スライドまたは PDF を手元に準備

*** Rの演習
    - [[http://whitewell.sakura.ne.jp/R/Rstatistics-01.html][Rで統計学を学ぶ(1)]]
    - [[http://whitewell.sakura.ne.jp/R/Rstatistics-02.html][Rで統計学を学ぶ(2)]]

    今日の演習内容をファイルに保存しましょう。
    - 自分のRの演習フォルダに
    - 日付と項目がわかるように。


   - 参考サイト
     - [[http://whitewell.sakura.ne.jp/R/][Webpage for Probability Theory and Statistics (B)]]
     - http://wiki.cis.iwate-u.ac.jp/~suzuki/RforS/ 


* 1st 10/07
  
** 講義について

   - シラバス

     - 引き継いだだけの状態，要相談
    
   - 講師の自己紹介

     - 生物，生命に関し，まったくの素人

     - 数学としての確率・統計を教えている

     - お昼休みサッカー

       - 12:30 ~ グラウンド， 2~10名でのミニゲーム，素人多数，先生，職
         員，学生

   - 講義内容
    
   - 講義方法
   - 講義に関する相談
     - 統計に関する既習のことの確認
     - パソコンの知識
     - 確率統計に関する確認事項
     - Rの習得法

      
** スライドとデータの準備

   - ダウンロード
   - 解凍
   - 確認
     - office 有無
     - ファイル，フォルダ操作の慣れ
 
** 前期の確率統計の内容確認
   
   - 確率
     - 事前確率，事後確率，ベイズの定理
   - 記述統計
     - 平均，分散，共分散，相関
   - 確率分布
     - 確率変数
     - 確率密度関数
     - 期待値
   - ベルヌーイ試行，二項分布，多項分布
   - 一様分布，正規分布，2次元正規分布
   - カイ二乗分布，t-分布，F-分布
   - 母集団と標本
     - 大数の法則，中心極限定理
     - 標本平均が従がう分布の平均と分散
   - 推定
     - 最尤推定
     - 母平均値の区間推定
     - 母分散の区間推定
  - 仮説検定

  復習しながら学んでいきましょう。
       
** R のインストール
   
   スライド 00 (解凍したスライドの00章)
   - R とは
   - R のインストール
     - ダウンロード [[http://www.okadajp.org/RWiki/?CRAN%E5%9B%BD%E5%86%85%E3%83%9F%E3%83%A9%E3%83%BC%E3%81%AE%E4%BD%BF%E3%81%84%E6%96%B9][CRAN国内ミラーの使い方 - RjpWiki]]
     - インストーラの実行
     - 確認
  - Rコマンダーのインストール
    - R の起動
    - R のパッケージインストール
      : install.packages("Rcmdr")
    - Rcmdr の起動       
      : library(Rcmdr)

